---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.ViewDetailLevelIsHighInLargeView
source: html/80df7346-e018-338f-b41b-b5d95aebd53a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.ViewDetailLevelIsHighInLargeView Property

A large view has view detail level set to medium or coarse. Generation of extraneous details harms performance.

## Syntax (C#)
```csharp
public static FailureDefinitionId ViewDetailLevelIsHighInLargeView { get; }
```